app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "1"], ["body", "1"], ["created_at", "2021-10-25 04:33:04.067359"], ["updated_at", "2021-10-25 04:33:04.067359"], ["user_id", 10]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    @user = current_user
    @books = Book.all
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "q更新"], ["updated_at", "2021-10-24 10:20:37.790866"], ["id", 6]]
---
  def update
    @books = Book.all
    @book = Book.find(params[:id])
    if @book.update(book_params)