app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?)  [["user_id", 10], ["created_at", "2021-10-30 09:48:11.166371"], ["updated_at", "2021-10-30 09:48:11.166371"], ["book_id", 1]]
---
  def create
    @book = Book.find(params[:book_id])
    favorite = current_user.favorites.new(book_id:@book.id)
    favorite.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["user_id", 10], ["book_id", 1], ["user_id", 10], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
  def destroy
   @book = Book.find(params[:book_id])
  # books = Book.all
    favorite = current_user.favorites.find_by(book_id: @book.id)
    favorite.destroy