app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 4]]
---
  def show
    @user = User.find(params[:id])
    @book = Book.new
    @books = Book.where(user_id: @user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "名前２３"], ["profile_image_id", nil], ["introduction", ""], ["updated_at", "2021-10-24 10:19:55.833697"], ["id", 9]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)